# SetExportLinetypeTable Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseExportOptions..::..SetExportLinetypeTable Method
BaseExportOptions Class See Also
---
Sets the line type table to use during export.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetExportLinetypeTable(
	ExportLinetypeTable linetypeTable
)
```

Visual Basic
---
```text
Public Sub SetExportLinetypeTable ( _
	linetypeTable As ExportLinetypeTable _
)
```

Visual C++
---
```text
public:
void SetExportLinetypeTable(
	ExportLinetypeTable^ linetypeTable
)
```

# ### Parameters
linetypeTable
    Type: Autodesk.Revit.DB..::..ExportLinetypeTable The line type table to be set.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace